app/views/schools/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 16]]
---
<ul>
    <% @school.students.each do |s| %>