app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def show
    @school = School.find(params[:id])
      @this_schools_students = Student.all.select{ |student| student.school_id == @school.id}
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"