app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student = Student.all.find(params[:id])
    @this_students_school = School.all.find_by_id(@student.school_id)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 7]]
---
  def destroy
    ham = Student.all.find_by(id: params[:id])
    school_id = ham.school.id
    ham.delete